PeterVranken/TRK-USB-MPC5643L/LSM/RTOS/code/mai_main.c
    /* Initialize the RTOS kernel. */
    rtos_initKernel();

    /* The code down here becomes our idle task. It is executed when and only when no
       application task is running. */

    while(true)
    {
        checkAndIncrementTaskCnts(pseudoIdTaskIdle);
        ++ mai_cntIdle;

        /* Activate the non cyclic task. */
#ifdef DEBUG
        bool bActivationAccepted =
#endif
        rtos_activateTask(idTaskNonCyclic);
        assert(bActivationAccepted);

        /* Compute the average CPU load. Note, this operation lasts about 1s and has a
           significant impact on the cycling speed of this infinite loop. Furthermore, it
           measures only the load produced by the tasks and system interrupts but not that
           of the rest of the code in the idle loop. */
        mai_cpuLoad = gsl_getSystemLoad();
        iprintf( "CPU load is %u.%u%%. Stack reserve: %u Byte. Failed task activations:\r\n"
                 "  task1ms: %u\r\n"
                 "  task3ms: %u\r\n"
                 "  task1s: %u\r\n"
                 "  taskNonCyclic: %u\r\n"
                 "  task17ms: %u\r\n"
                 "  taskOnButtonDown: %u\r\n"
                 "  taskCpuLoad: %u\r\n"
               , mai_cpuLoad/10, mai_cpuLoad%10
               , rtos_getStackReserve()
               , rtos_getNoActivationLoss(idTask1ms)
               , rtos_getNoActivationLoss(idTask3ms)
               , rtos_getNoActivationLoss(idTask1s)
               , rtos_getNoActivationLoss(idTaskNonCyclic)
               , rtos_getNoActivationLoss(idTask17ms)
               , rtos_getNoActivationLoss(idTaskOnButtonDown)
               , rtos_getNoActivationLoss(idTaskCpuLoad)
               );
#if 0
        /* Test of return from main: After 10s */
        if(mai_cntTask1ms >= 10000)
            break;
#endif
    }
} /* End of main */
